{
  "events": [
    {
      "id": "1",
      "slug": "latina-leadership-summit-2023",
      "name": "Latina Empire Leadership Summit 2023",
      "location": "Miami, FL",
      "date": "November 15-17, 2023",
      "startTime": "9:00 AM",
      "endTime": "6:00 PM",
      "description": "The Latina Empire Leadership Summit is our flagship three-day immersive experience designed to unleash your full leadership potential. Join over 500 ambitious Latinas for powerful keynotes from Fortune 500 executives, interactive workshops led by certified leadership coaches, and transformative networking experiences. \n\nDay 1 focuses on personal leadership development and overcoming the unique challenges faced by Latina professionals. Day 2 dives into executive presence, strategic thinking, and building influence. Day 3 helps you develop your personalized roadmap for advancement with accountability partners and ongoing support.\n\nYou'll leave with clarity on your leadership vision, proven strategies to overcome cultural and gender barriers, and a supportive network of like-minded women who will become your career-long allies. The summit includes all workshop materials, gourmet meals and refreshments, access to our exclusive evening networking receptions, and one year of membership in our Latina Leadership Circle.",
      "shortDescription": "Our signature leadership summit delivering transformational strategies, powerful connections, and actionable frameworks for ambitious Latina professionals.",
      "host": "Elena Rodriguez",
      "hostTitle": "Founder & CEO, Latina Empire",
      "hostImage": "https://images.unsplash.com/photo-1508214751196-bcfd4ca60f91?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=256&q=80",
      "image": "https://images.unsplash.com/photo-1475721027785-f74eccf877e2?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
      "bannerImage": "https://images.unsplash.com/photo-1475721027785-f74eccf877e2?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1950&q=80",
      "isPast": true,
      "ticketPrice": "$1,497",
      "ticketLink": "#",
      "locationMapUrl": "https://maps.google.com",
      "locationAddress": "Intercontinental Miami, 100 Chopin Plaza, Miami, FL 33131"
    },
    {
      "id": "2",
      "slug": "entrepreneurship-intensive-2023",
      "name": "Latina Empire Entrepreneurship Intensive",
      "location": "Los Angeles, CA",
      "date": "October 14-15, 2023",
      "startTime": "9:00 AM",
      "endTime": "6:00 PM",
      "description": "The Latina Empire Entrepreneurship Intensive is our premier two-day business acceleration program designed specifically for Latina founders and aspiring entrepreneurs. This high-impact bootcamp equips you with proven frameworks, essential tools, and powerful connections needed to launch and scale successful businesses.\n\nOn Day 1, we focus on business foundations: developing your value proposition, validating your market, mapping business models, and crafting compelling pitches. Day 2 accelerates your growth with workshops on securing funding (including our angel investor matchmaking session), building effective teams, creating scalable operations, and navigating the unique challenges faced by Latina entrepreneurs.\n\nThis immersive experience includes hands-on exercises led by successful Latina business owners, one-on-one coaching sessions with industry experts, an exclusive pitch competition with real investor feedback, and lifetime access to our Latina Founders Network. You'll leave with a refined business plan, go-to-market strategy, and the confidence to take your venture to the next level.",
      "shortDescription": "A high-powered business acceleration program for Latina entrepreneurs ready to launch or scale their ventures with confidence.",
      "host": "Carmen Vega",
      "hostTitle": "Director of Entrepreneurship, Latina Empire",
      "hostImage": "https://images.unsplash.com/photo-1544005313-94ddf0286df2?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=256&q=80",
      "image": "https://images.unsplash.com/photo-1529070538774-1843cb3265df?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
      "bannerImage": "https://images.unsplash.com/photo-1529070538774-1843cb3265df?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1950&q=80",
      "isPast": true,
      "ticketPrice": "$997",
      "ticketLink": "#",
      "locationMapUrl": "https://maps.google.com",
      "locationAddress": "The LINE LA, 3515 Wilshire Blvd, Los Angeles, CA 90010"
    },
    {
      "id": "3",
      "slug": "personal-branding-masterclass",
      "name": "Latina Empire Personal Branding Masterclass",
      "location": "New York, NY",
      "date": "December 9, 2023",
      "startTime": "9:00 AM",
      "endTime": "5:00 PM",
      "description": "The Latina Empire Personal Branding Masterclass is an intensive one-day immersion designed to help ambitious Latina professionals build and leverage a powerful personal brand. In today's competitive landscape, your personal brand is your greatest career asset—this masterclass gives you the exact frameworks and tools needed to stand out authentically.\n\nUnder the guidance of award-winning brand strategists and communications experts, you'll work through our proprietary 5-step personal branding methodology: defining your unique value proposition, crafting your compelling narrative, building your strategic online presence, developing your signature style, and expanding your influence through strategic networking.\n\nThis hands-on experience includes interactive workshops, professional headshots by our celebrity photographer, personalized brand strategy document, one-on-one feedback sessions, and lifetime access to our digital branding toolkit. You'll leave with a comprehensive personal branding strategy and the confidence to implement it immediately.",
      "shortDescription": "Master the art of authentic personal branding to elevate your career, expand your influence, and create powerful new opportunities.",
      "host": "Isabel Morales",
      "hostTitle": "Chief Brand Officer, Latina Empire",
      "hostImage": "https://images.unsplash.com/photo-1573497161161-c3e73707e25c?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=256&q=80",
      "image": "https://images.unsplash.com/photo-1557804506-669a67965ba0?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
      "bannerImage": "https://images.unsplash.com/photo-1557804506-669a67965ba0?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1950&q=80",
      "isPast": true,
      "ticketPrice": "$697",
      "ticketLink": "#",
      "locationMapUrl": "https://maps.google.com",
      "locationAddress": "Convene, 101 Park Avenue, New York, NY 10178"
    },
    {
      "id": "4",
      "slug": "latina-wellness-retreat-2024",
      "name": "Latina Empire Wellness & Wealth Retreat",
      "location": "Tulum, Mexico",
      "date": "June 15-18, 2024",
      "startTime": "8:00 AM",
      "endTime": "9:00 PM",
      "description": "Join us for a transformational four-day retreat that will rejuvenate your health and build your wealth at the stunning beaches of Tulum. The Latina Empire Wellness & Wealth Retreat combines holistic wellness practices with powerful wealth-building strategies designed specifically for ambitious Latina professionals. \n\nEach day features expert-led workshops on financial investment, morning yoga and meditation sessions, masterclasses on entrepreneurship, healthy cooking demonstrations featuring authentic Latin cuisine, and evening networking events with successful Latina business leaders. \n\nYou'll leave with a personalized wellness plan, concrete financial strategies, and a supportive network of like-minded Latina professionals who are committed to mutual success. This all-inclusive luxury experience includes premium oceanfront accommodations, organic farm-to-table meals, and all workshop materials.",
      "shortDescription": "A transformational retreat where you'll rejuvenate your health and build your wealth in a tropical paradise.",
      "host": "Elena Rodriguez",
      "hostTitle": "Founder & CEO, Latina Empire",
      "hostImage": "https://images.unsplash.com/photo-1508214751196-bcfd4ca60f91?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=256&q=80",
      "image": "https://images.unsplash.com/photo-1504814532849-cff240bbc503?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
      "bannerImage": "https://images.unsplash.com/photo-1504814532849-cff240bbc503?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1950&q=80",
      "isPast": false,
      "ticketPrice": "$2,997",
      "ticketLink": "#",
      "locationMapUrl": "https://maps.google.com",
      "locationAddress": "Carretera Tulum-Boca Paila Km 7, Tulum, Q.R., Mexico"
    },
    {
      "id": "5",
      "slug": "latinas-in-tech-summit-2024",
      "name": "Latina Empire Tech & Innovation Summit",
      "location": "Austin, TX",
      "date": "May 17-18, 2024",
      "startTime": "8:30 AM",
      "endTime": "6:30 PM",
      "description": "The Latina Empire Tech & Innovation Summit is the premier gathering for Latina professionals, entrepreneurs, and students in the technology sector. This dynamic two-day event brings together the brightest minds in tech for an immersive experience of learning, connection, and career advancement.\n\nDay 1 features powerful keynotes from pioneering Latina tech executives from companies like Google, Microsoft, and leading startups, followed by specialized tracks in Engineering, Product Management, Data Science, and Tech Leadership. Day 2 delivers hands-on workshops in AI, blockchain, UX/UI design, and coding bootcamps, coupled with our signature Tech Career Accelerator featuring on-site interviews with recruiters from Fortune 500 companies.\n\nThroughout the summit, you'll participate in facilitated networking sessions, mentor matching, pitch competitions, and our exclusive Latinas in Tech Awards ceremony celebrating outstanding achievements. You'll leave with enhanced technical skills, expanded professional connections, and a clear roadmap for advancing your career in the dynamic tech landscape.",
      "shortDescription": "The premier tech summit for Latina innovators featuring hands-on workshops, influential speakers, and unparalleled networking with industry leaders.",
      "host": "Sofia Martinez",
      "hostTitle": "Director of Technology Initiatives, Latina Empire",
      "hostImage": "https://images.unsplash.com/photo-1614644147798-f8c0fc9da7f6?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=256&q=80",
      "image": "https://images.unsplash.com/photo-1547489401-fcada4966052?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
      "bannerImage": "https://images.unsplash.com/photo-1547489401-fcada4966052?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1950&q=80",
      "isPast": false,
      "ticketPrice": "$797",
      "ticketLink": "#",
      "locationMapUrl": "https://maps.google.com",
      "locationAddress": "Fairmont Austin, 101 Red River St, Austin, TX 78701"
    },
    {
      "id": "6",
      "slug": "latina-empire-leadership-conference-2024",
      "name": "Latina Empire Global Leadership Conference",
      "location": "Chicago, IL",
      "date": "October 4-6, 2024",
      "startTime": "8:00 AM",
      "endTime": "8:00 PM",
      "description": "The Latina Empire Global Leadership Conference is our premier annual gathering, bringing together over 1,000 of the most ambitious and accomplished Latina professionals from around the world for an immersive three-day experience that will transform your leadership trajectory.\n\nThis year's theme, 'Leading Without Limits,' features an unparalleled lineup of globally recognized speakers including Fortune 500 CEOs, bestselling authors, political leaders, and cultural changemakers. The conference curriculum combines inspirational keynotes, intensive skills workshops, strategic masterminds, and executive panels addressing the unique challenges and opportunities for Latina leaders in today's global landscape.\n\nDay 1 focuses on Personal Leadership Mastery, Day 2 on Professional Leadership Strategy, and Day 3 on Community Leadership Impact. Throughout the conference, you'll engage in facilitated networking sessions, exclusive VIP receptions, curated mentor matching, and our signature Awards Gala celebrating exceptional Latina leadership.\n\nYou'll leave with enhanced leadership capabilities, powerful connections with influential allies and sponsors, and a comprehensive action plan for your next-level success. Your registration includes access to all sessions, premium conference materials, gourmet meals, evening social events, and one year of membership in our Global Latina Leaders Network.",
      "shortDescription": "Our flagship global gathering of visionary Latina leaders featuring world-renowned speakers, transformational workshops, and unmatched networking with changemakers from around the world.",
      "host": "Elena Rodriguez",
      "hostTitle": "Founder & CEO, Latina Empire",
      "hostImage": "https://images.unsplash.com/photo-1508214751196-bcfd4ca60f91?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=256&q=80",
      "image": "https://images.unsplash.com/photo-1540317580384-e5d43867caa6?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
      "bannerImage": "https://images.unsplash.com/photo-1540317580384-e5d43867caa6?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1950&q=80",
      "isPast": false,
      "ticketPrice": "$1,997",
      "ticketLink": "#",
      "locationMapUrl": "https://maps.google.com",
      "locationAddress": "Marriott Magnificent Mile, 540 N Michigan Ave, Chicago, IL 60611"
    },
    {
      "id": "7",
      "slug": "latina-financial-empowerment-workshop-2024",
      "name": "Latina Empire Wealth Building Masterclass",
      "location": "Virtual Event",
      "date": "July 15, 2024",
      "startTime": "10:00 AM",
      "endTime": "4:00 PM",
      "description": "The Latina Empire Wealth Building Masterclass is our premier virtual financial accelerator designed specifically for ambitious Latina professionals and entrepreneurs. This comprehensive program gives you the exact strategies, tools, and mindset shifts needed to build lasting wealth and financial independence.\n\nLed by a team of certified Latina financial experts who have built seven-figure portfolios, this intensive masterclass covers advanced financial literacy topics including strategic budgeting, tax-efficient investing, retirement optimization, real estate wealth creation, business scaling, and building generational wealth within the Latina cultural context.\n\nUnlike generic financial programs, this masterclass addresses the unique challenges and opportunities for Latinas navigating financial systems while honoring cultural values. The experience includes pre-work financial assessments, live interactive workshop sessions, personalized financial plan development, breakout strategy sessions, and 90 days of implementation support with monthly accountability check-ins.\n\nYou'll graduate with a customized wealth-building roadmap, practical financial tools, automated systems, and membership in our exclusive Latina Wealth Circle community where you can continue your financial journey with ongoing support.",
      "shortDescription": "An intensive masterclass that gives Latina professionals proven frameworks to build wealth, secure financial independence, and create a powerful legacy.",
      "host": "Maria Gonzalez",
      "hostTitle": "Chief Financial Strategist, Latina Empire",
      "hostImage": "https://images.unsplash.com/photo-1580489944761-15a19d654956?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=256&q=80",
      "image": "https://images.unsplash.com/photo-1434626881859-194d67b2b86f?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
      "bannerImage": "https://images.unsplash.com/photo-1434626881859-194d67b2b86f?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1950&q=80",
      "isPast": false,
      "ticketPrice": "$497",
      "ticketLink": "#",
      "locationMapUrl": null,
      "locationAddress": "Online Event"
    }
  ]
}